app/controllers/feed_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  def index

    if user_signed_in?
      @new_event_link = "#"
      @dropdown_partial = "shared/logged_in_dropdown"
      @has_phone_number = User.find_by(id: current_user.id).telephone_number.nil?